# IFC_GetNumPsetProps

## Description
Returns the number of properties in a given Property Set

```pascal
FUNCTION IFC_GetNumPsetProps(
				strPsetName     : STRING;
				VAR outNumPsets : INTEGER): BOOLEAN;
```

```python
def vs.IFC_GetNumPsetProps(strPsetName):
    return (BOOLEAN, outNumPsets)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|strPsetName|STRING|   |
|outNumPsets|INTEGER|   |

## Version
Availability: from Vectorworks 2022

## Category
* IFC